#+TITLE:        Tomono — Multi- to Monorepo Migration
#+DESCRIPTION:  Migrate your multirepo to a monorepo using a bash script
#+AUTHOR:       Hraban Luyat
#+EMAIL:        hraban@0brg.net
#+PROPERTY:     header-args       :noweb no-export

#+BEGIN_SRC txt :references lala :exports none
for later:
,#+PROPERTY:     header-args:shell :comments link
#+END_SRC

#+NAME: configure-org-mode-for-this-file
#+BEGIN_SRC emacs-lisp :exports results :results none
  ;; This is configuration for org mode itself, not tomono src code. Don't export this.

  ;; TODO: Don't define as global functions? How do you do this in EL?

  (defun org-info-name (info)
    (nth 4 info))

  (defun insert-ln (&rest args)
    (apply #'insert args)
    (newline))

  (defun should-reference (info)
    "Determine if this info block is a referencing code block"
    (not (memq (alist-get :noweb (nth 2 info))
               '(nil "no"))))

  (defun re-findall (re str &optional offset)
    "Find all matches of a regex in the given string"
    (let ((start (string-match re str offset))
          (end (match-end 0)))
      (when (numberp start)
        (cons (substring str start end) (re-findall re str end)))))

  ;; Match groups are the perfect tool to achieve this but EL's regex is
  ;; inferior and it's not worth the hassle. Blag it manually.

  (defun strip-delimiters (s prefix suffix)
    "Strip a prefix and suffix delimiter, e.g.:
  (strip-delimiters \"<a>\" \"<\" \">\")
  => \"a\"

  Note this function trusts the input string has those delimiters"
    (substring s (length prefix) (- (length suffix))))

  (defun strip-noweb-delimiters (s)
    "Strip the org noweb link delimiters, usually << and >>"
    (strip-delimiters s org-babel-noweb-wrap-start org-babel-noweb-wrap-end))

  (defun extract-refs (body)
    (mapcar #'strip-noweb-delimiters (re-findall (org-babel-noweb-wrap) body)))

  (defun add-to-hash-list (k elem hash)
    "Assuming the hash values are lists, add this element to k's list"
** Set up the monorepo directory

We create a fresh directory for this script to run in, and bail if it already exists to avoid mangling an existing repo.

#+CAPTION: prep-dir
#+NAME: prep-dir
#+BEGIN_SRC sh
: "${MONOREPO_NAME:=core}"
if [[ -d "$MONOREPO_NAME" ]]; then
    >&2 echo "monorepo directory $MONOREPO_NAME already exists"
    exit 1
fi

mkdir "$MONOREPO_NAME"
cd "$MONOREPO_NAME"
git init
#+END_SRC

The reason we don't just do this:
#+BEGIN_SRC sh :tangle no :results inline
echo HELLO THERE
date
#+END_SRC

#+RESULTS:
| HELLO | THERE |     |      |          |     |
| Tue   |    24 | Mar | 2020 | 18:33:58 | GMT |

is because that would be crazy.

